app/views/wishes/index.html.erb


              <li>Rewards: <span><%=wish.items.count %></span> </li>
---
SELECT COUNT(*) FROM "items" WHERE "items"."wish_id" = 1