app/controllers/wishes_controller.rb

  def index
    @wishes = Wish.all


#    @user = User.find(params[:user_id]) if params[:user_id].present?
    @user ||=  current_user
    if @user

      @completed_wishes =  @user.wishes.where(:status => "completed")
---
SELECT "wishes".* FROM "wishes"
SELECT "wishes".* FROM "wishes" WHERE "wishes"."user_id" = 1 AND "wishes"."status" = 'inprogress'

  def create


    @wish = Wish.new(params[:wish])
    @wish.user_id = current_user.id

    respond_to do |format|
      if @wish.save
---
INSERT INTO "wishes" ("close_date", "completion_date", "created_at", "description", "goal", "image", "public_url", "rewards", "slug", "status", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)